Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
mobilenetv2_1.00_224 (Model) (None, 7, 7, 1280)        2257984   
_________________________________________________________________
conv2d (Conv2D)              (None, 5, 5, 50)          576050    
_________________________________________________________________
dropout (Dropout)            (None, 5, 5, 50)          0         
_________________________________________________________________
global_average_pooling2d (Gl (None, 50)                0         
_________________________________________________________________
dense (Dense)                (None, 5)                 255       
=================================================================
Total params: 2,834,289
Trainable params: 2,644,017
Non-trainable params: 190,272
_________________________________________________________________
